app/controllers/articles_controller.rb

  def index
    @article = current_user.articles.last if user_signed_in?
    @articles = Article.includes(:user).order("created_at desc")
    users = User.all
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`user_id` = 4 ORDER BY `articles`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)
SELECT  `users`.* FROM `users` ORDER BY RANDOM() LIMIT 1

  def create
    Article.create(articles_params)
---
INSERT INTO `articles` (`title`, `text`, `image`, `created_at`, `updated_at`, `user_id`) VALUES ('ラーメン', 'ラーメン', 'df62ecf2fb5d4e5bd4bdea71a45ddd3370c23996.jpeg', '2019-06-12 01:02:41', '2019-06-12 01:02:41', 4)

  def update
    article = Article.find(params[:id])
    article.update(articles_params) if article.user_id == current_user.id
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 15 LIMIT 1
UPDATE `articles` SET `text` = 'どうだ', `updated_at` = '2019-06-11 08:51:07' WHERE `articles`.`id` = 20

  def destroy
    article = Article.find(params[:id])
    article.destroy
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 23 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 23