app/controllers/users_controller.rb

  def show
    @article = current_user.articles.last if user_signed_in?
    @articles = Article.where(user_id: params[:id]).order("created_at desc")
    users = User.all
    @users= users.reject{|user| user.id == current_user.id} if user_signed_in?
    @user = User.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`user_id` = 4 ORDER BY `articles`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1